Documents/Трудоустройство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Трудоустройство</Name>
			<BasedOn>
				<xr:Item>Catalog.Обучающиеся</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассныйРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДвиженияОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДвиженияОбучающихся</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчислен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияОбучающегося</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Условно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Трудоустройство/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьАктуальныйПриказ(Ссылка)
	Отбор = Новый Структура("Обучающийся", Ссылка);
	Срез = РегистрыСведений.ДвиженияОбучающихся.СрезПоследних(Объект.Дата,Отбор);
	Если Срез.Количество() < 1 Тогда  // Если не найдено данных
		Отчислен = Ложь;
		
		Возврат Ложь;
	Иначе
		 АктуальныйПриказ = Срез[0].Регистратор;
		 Объект.Класс = Срез[0].Класс;   
		 ЗапросУчебныйГод = Новый Запрос("ВЫБРАТЬ
		                                 |	УчебныеГодаКлассноеРуководство.Класс КАК Класс,
		                                 |	УчебныеГодаКлассноеРуководство.КлассныйРуководитель КАК КлассныйРуководитель
		                                 |ИЗ
		                                 |	Справочник.УчебныеГода.КлассноеРуководство КАК УчебныеГодаКлассноеРуководство
		                                 |ГДЕ
		                                 |	УчебныеГодаКлассноеРуководство.Класс = &Класс
		                                 |	И УчебныеГодаКлассноеРуководство.Ссылка = &УчебныйГод");
		 ЗапросУчебныйГод.УстановитьПараметр("Класс",Объект.Класс);
		 ЗапросУчебныйГод.УстановитьПараметр("УчебныйГод",Срез[0].УчебныйГод);
		 Выборка = ЗапросУчебныйГод.Выполнить().Выбрать();
		 Если Выборка.Следующий() Тогда
			Объект.КлассныйРуководитель = Выборка.КлассныйРуководитель;	 
		Иначе
			Объект.КлассныйРуководитель = Справочники.Сотрудники.ПустаяСсылка();		
		 КонецЕсли;
		 Возврат Истина;
	КонецЕсли
КонецФункции

&НаКлиенте
Процедура ОбучающийсяПриИзменении(Элемент)
	Ответ = ПолучитьАктуальныйПриказ(Объект.Обучающийся);
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДаты()
	ТекущийГод = Год(ТекущаяДата()); 
	Объект.НачалоПериода = Дата(ТекущийГод,06,01);
	Объект.КонецПериода = Дата(ТекущийГод,08,31);
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Ответ = ПолучитьАктуальныйПриказ(Объект.Обучающийся);
	ЗаполнитьДаты();
КонецПроцедуры
